@mldmld68 I can't repro this issue as I do see the below resource that is going to recreate as well along with the instance recreation. I would encourage you to look into the dynamic code to see how it impacts. Let me know how it works. You may also post your debug log so I can take a look

```
  # google_compute_instance_iam_member.allow_on_off_role_on_jumpbox_to_tbr_group_for_linux must be replaced
-/+ resource "google_compute_instance_iam_member" "allow_on_off_role_on_jumpbox_to_tbr_group_for_linux" {
      ~ etag          = "BwWuQ3oZS5I=" -> (known after apply)
      ~ id            = "projects/autotest/zones/us-central1-a/instances/issue7166-local/roles/compute.osLogin/user:chrisst@google.com" -> (known after apply)
      ~ instance_name = "projects/autotest/zones/us-central1-a/instances/issue7166-local" -> (known after apply) # forces replacement
        member        = "user:testuser@google.com"
      ~ project       = "autotest" -> (known after apply)
        role          = "roles/compute.osLogin"
      ~ zone          = "us-central1-a" -> (known after apply)
    }
```